OpenDTEF-v1812/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/0.orig/CT
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      CT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<symmTensor>
8025
(
(4.501854 0 0 3.437531 0 1.537743)
(0.000572 0 0 6.9153941e+09 0 56298.328)
(0.000461 0 0 14082324 0 238.79688)
(0.103252 0 0 0.344817 0 0.500184)
(0.210715 0 0 0.279468 0 0.395429)
(8.5626485e+09 0 0 0 0 9.4061557e+09)
(0.001095 0 0 0 0 0.015342)
(0.00022 0 0 1911223.6 0 0.017895)
...
)
;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   ( 0 0 0 0 0 0 );
        value               uniform ( 0 0 0 0 0 0 );
    }
    ground
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    baffleWall
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 0 0 0 );
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
